# FillPatternElement Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillPatternElement Class
Members See Also
---
An element that represents a fill pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class FillPatternElement : Element
```

Visual Basic
---
```text
Public Class FillPatternElement _
	Inherits Element
```

Visual C++
---
```text
public ref class FillPatternElement : public Element
```

# Remarks
The FillPatternElement represents a fill pattern in a project. It enables the user to retrieve, modify or create a fill pattern in a project.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..FillPatternElement
# See Also
FillPatternElement Members
Autodesk.Revit.DB Namespace